tests/Company/CompanyServiceTest/testListSubscriptionsBy.yml


-
    request:
        method: GET
        url: 'http://wizaplace.loc/api/v1/users/authenticate'
        headers:
            Host: wizaplace.loc
            Accept-Encoding: null
            Authorization: 'Basic YWRtaW5Ad2l6YXBsYWNlLmNvbTpXaW5kb3dzLjk4'
            User-Agent: Wizaplace-PHP-SDK/dev-feature-WIZ-9030-refacto-subscription-command-and-retry-count@62490bf
            VCR-index: '0'
            Accept: null
    response:
        status:
            http_version: '1.1'
            code: '200'
            message: OK
        headers:
            Server: nginx
            Content-Type: application/json
            Transfer-Encoding: chunked
            Connection: keep-alive
            X-Powered-By: PHP/7.4.14
            Cache-Control: 'no-cache, private'
            Date: 'Thu, 22 Apr 2021 14:59:58 GMT'
            Content-Language: fr
            Access-Control-Allow-Origin: '*'
            X-Debug-Token: 1c3560
            X-Debug-Token-Link: 'http://wizaplace.loc/_profiler/1c3560'
            X-Robots-Tag: noindex
            X-Request-Id: 249847b3d4c4df7a902e6b941651be06
        body: '{"id":2,"apiKey":"W03E8ZUPWmfeHUp135lkzEWMhaBWEGDNcDg6v8BW"}'
-
    request:
        method: GET
        url: 'http://wizaplace.loc/api/v1/companies/1/subscriptions?limit=10&offset=0'
        headers:
            Host: wizaplace.loc
            Accept-Encoding: null
            User-Agent: Wizaplace-PHP-SDK/dev-feature-WIZ-9030-refacto-subscription-command-and-retry-count@62490bf
            Authorization: 'token W03E8ZUPWmfeHUp135lkzEWMhaBWEGDNcDg6v8BW'
            VCR-index: '1'
            Accept: null
    response:
        status:
            http_version: '1.1'
            code: '200'
            message: OK
        headers:
            Server: nginx
            Content-Type: application/json
            Transfer-Encoding: chunked
            Connection: keep-alive
            X-Powered-By: PHP/7.4.14
            Cache-Control: 'no-cache, private'
            Date: 'Thu, 22 Apr 2021 14:59:58 GMT'
            Content-Language: fr
            Access-Control-Allow-Origin: '*'
            X-Debug-Token: '991361'
            X-Debug-Token-Link: 'http://wizaplace.loc/_profiler/991361'
            X-Robots-Tag: noindex
            X-Request-Id: 8358ce396294ddd7e32d002a5dffb05f
        body: '{"limit":10,"offset":0,"total":1,"items":[{"id":"4895bcaf-f3ad-4f8a-8c60-2420ac5a2257","userId":4,"companyId":1,"cardId":"9e1f2319-618b-47f7-80bd-7445cd0169ea","firstOrderId":123808,"name":"test tel","status":"DISABLED","price":{"excludingTaxes":"4.08","taxes":"0.82","includingTaxes":"4.9"},"isAutorenew":false,"commitmentPeriod":24,"paymentFrequency":12,"nextPaymentAt":"2022-04-22","commitmentEndAt":"2045-04-22","createdAt":"2021-04-22T16:56:33+02:00","renewAttemptsCount":0}]}'
